# 4.137 Даны целое число k (1 ≤ k ≤ 180) и последовательность цифр 10111213141516...9899, в которой выписаны подряд все
# двузначные числа. Определить k-ю цифру.(Решить числовым методом).
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# def someInt(num1, num2):
#     num3 = 1
#     num4 = num1
#     while num1 // 100 > 0:
#         num3 += 1
#         num1 //= 100
#     while num3 > num2:
#         num3 -= 1
#         num4 //= 100
#         if num3 == num2:
#             num5 = num4 % 100
#     return num5
#
#
# print(someInt(1011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859, 9))
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 5.62 Известны оценки по физике каждого ученика двух классов. Определить среднюю оценку в каждом классе.
# Количество учащихся в каждом классе одинаковое.
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# def srRating(num1, num2):
#     num3 = sum(num1) / len(num1)
#     num4 = sum(num2) / len(num2)
#     return num3, num4
#
#
# num1, num2 = srRating([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20], [1, 2, 3, 4, 5, 6, 7,
#                       8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20])
# print(num1, num2)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 2.43 Даны два целых числа a и b. Если a делится на b или b делится на а, то вывести 1, иначе - любое другое число.
# Условные операторы и операторы цикла не использовать.
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# def someInt(a, b):
#     с = a % b == 0 and b % a == 0
#     print(int(с))
#
#
# someInt(1, 1)
# someInt(2, 1)
# someInt(2, 5)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 17.7 Известны стоимости 12 марок телевизоров (все значения разные). Определить стоимость телевизора, являющегося
# 'пятым из самых дешевых моделей'.
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# def someCost(num1):
#     num2 = sorted(num1)
#     num3 = num2[4]
#     return num3
#
#
# print(someCost([10, 20, 3, 4, 5, 6, 7, 3, 0, 10, 0, 12]))
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 6.97 Известно количество очков, набранных каждой из 20-ти команд-участниц первенства по футболу. Перечень очков дан
# в порядке убывания(ни одна пара команд не набрала одинаковое количество очков). Определить, какое место заняла
# команда, набравшая N очков(естественно, что значение N имеется в перечне). Условный оператор не использовать.
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# def somePlace(num1, num2):
#     num3 = sorted(num1, reverse=True)
#     num4 = num3.index(num2)
#     num5 = num4 + 1
#     print(num5,'- место')
#
#
# somePlace([10, 19, 18, 25, 16, 15, 0, 13, 223, 11, 0, 9, 80, 7, 6, 31, 4, 532, 123, 4231], 0)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
